packages/foamlib/foamlib-1.1.6.tar.gz/foamlib-1.1.6/example/parametricStudy/damBreak/system/simulationParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      simulationParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// grid refinement
res1 23;
res2 8;
res3 19;
res4 42;
res5 4;

initHeight 0.3;


// ************************************************************************* //
